cellium-updates.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-03 Fri 05:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CELLIUM 004 - Apr 2026</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<meta http-equiv="Content-Security-Policy" content="style-src-elem 'self' https://wmealing.github.io;">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="Wade Mealings documentation" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CELLIUM 004 - Apr 2026</h1>
<nav class="navbar-custom">
    <div class="navbar-grid">

        <div class="navbar-section">
            <a href="systems.html" style="text-decoration: none;"><h3>Systems & Distributed Programming</h3></a>
            <div class="navbar-tags">
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Erlang/OTP</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Clojure</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Lisp Flavored Erlang</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag special">Cellium (TUI Framework)</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="security.html" style="text-decoration: none;"><h3>Security & Kernel Research</h3></a>
            <div class="navbar-tags">
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Linux Kernel Analysis</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">eBPF</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Malware Reversing</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Rust</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="tooling.html" style="text-decoration: none;"><h3>Tooling & Workflow</h3></a>
            <div class="navbar-tags">
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">Emacs / Elisp</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">CI/CD Pipelines</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">OpenSCAD</span></a>
            </div>
        </div>

    </div>
</nav>
<div id="outline-container-org30c1c85" class="outline-2">
<h2 id="org30c1c85">Summary: Docs published annd conversion to a 'library'.</h2>
<div class="outline-text-2" id="text-org30c1c85">
<p>
I didn't realise, <a href="https://github.com/therealcarloratm">therealcarloratm</a> had lodged an issue on the <a href="https://github.com/wmealing/cellium">cellium</a> git repo asking
about how to use this project as library. 
</p>

<p>
<a href="https://github.com/wmealing/celldemo">https://github.com/wmealing/celldemo</a>
</p>
</div>
</div>
<div id="outline-container-orgd78ee04" class="outline-2">
<h2 id="orgd78ee04">Introduction</h2>
<div class="outline-text-2" id="text-orgd78ee04">
<pre class="example" id="orgaaa2461">
===&gt; Dependency failure: source for cellium does not contain a recognizable project and can not be built
</pre>

<p>
The problem was that i had designed it as an <a href="https://adoptingerlang.org/docs/development/umbrella_projects/">umbrella project</a>, This type of application has multiple working
sub folders under the ./app/ folder.  I had only had one, with plans to add more related issues in the future.
</p>

<p>
Instead, I found out that others had been using my code, as is.. so I decided to restructure my app using the
rebar3 "app" template.
</p>

<p>
This should allow for applications to use this as a library, as therealcarloratm expected.
</p>
</div>
</div>
<div id="outline-container-org580eb98" class="outline-2">
<h2 id="org580eb98">Conclusion</h2>
<div class="outline-text-2" id="text-org580eb98">
<p>
My big takeaway here is to ensure that i dont use umbrella apps for libraries again.
</p>
</div>
</div>
<div id="outline-container-orgb105982" class="outline-2">
<h2 id="orgb105982">Resources:</h2>
<div class="outline-text-2" id="text-orgb105982">
</div>
<div id="outline-container-org3597bb0" class="outline-3">
<h3 id="org3597bb0">Using <a href="https://rebar3.org/docs/commands/">rebar commands</a></h3>
</div>
<div id="outline-container-org3b06f56" class="outline-3">
<h3 id="org3b06f56">The <a href="https://adoptingerlang.org/docs/development/umbrella_projects/">umbrella project</a></h3>
</div>
</div>
</div>
</body>
</html>
